{
    "id": 62506,
    "kind": "GIT",
    "auditfirm_id": 3,
    "impact": "MEDIUM",
    "finders_count": 1,
    "protocol_id": 3104,
    "title": "M-14: Value of Etherna's Withdrawal Request is incorrect",
    "content": "\nSource: https://github.com/sherlock-audit/2025-06-notional-exponent-judging/issues/665 \n\n## Found by \nxiaoming90\n\n### Summary\n\n-\n\n### Root Cause\n\n-\n\n### Internal Pre-conditions\n\n-\n\n### External Pre-conditions\n\n-\n\n### Attack Path\n\nIn Notional, when pricing a withdrawal request that has not been finalized yet, it will always price it against the number of yield tokens within the withdrawal request. This is the correct approach most of the time. For instance, it is correct to price the withdrawal request with wstETH using the wstETH price, because any slashing that occurs during the 7-day waiting period will affect the amount of ETH received at the end. This also applies to other Liquid Staking Tokens (LST) such as EtherFi's weETH. \n\nIf a major slashing event occurs, the market price of the LST will decrease accordingly and be reflected in the price provided by the oracle providers (e.g., Chainlink). This is because the market will take into consideration the adverse event that has occurred. This is how the normal market functions.\n\nThat being said, there are instances where it is incorrect to price the withdrawal request using the yield token's price. This generally applies to staking tokens that do not involve slashing, and the amount of tokens received at the end of the wait period is already predetermined when initiating the withdrawal and will not change regardless of subsequent events that may occur. Tokens that fit this category are often stable assets such as USDe.\n\nWhen the WithdrawRequestManager (WRM) calls `sUSDe.cooldownShares(cooldownBalance)`, the sUSDe shares will be converted to USDe assets in Line 112 below. The `cooldownBalance` number of sUSDe shares will be burned, and the corresponding USDe will be sent to SILO for holding/escrowing in Line 117 within the `_withdraw()` function.\n\nNote that converted USDe assets are sent to SILO for holding/escrowing and the number of USDe assets will not change regardless of any circumstances. The number of converted USDe assets is recorded with the `cooldowns[msg.sender].underlyingAmount` mapping in Line 115 below.\n\nhttps://etherscan.io/address/0x9d39a5de30e57443bff2a8307a4256c8797a3497#code#F1#L115\n\n```solidity\nFile: StakedUSDeV2.sol\n107:   /// @notice redeem shares into assets and starts a cooldown to claim the converted underlying asset\n108:   /// @param shares shares to redeem\n109:   function cooldownShares(uint256 shares) external ensureCooldownOn returns (uint256 assets) {\n110:     if (shares > maxRedeem(msg.sender)) revert ExcessiveRedeemAmount();\n111: \n112:     assets = previewRedeem(shares);\n113: \n114:     cooldowns[msg.sender].cooldownEnd = uint104(block.timestamp) + cooldownDuration;\n115:     cooldowns[msg.sender].underlyingAmount += uint152(assets);\n116: \n117:     _withdraw(msg.sender, address(silo), msg.sender, assets, shares);\n118:   }\n```\n\nTo prove this point, the number of USDe assets returned to the user is always equal to the `userCooldown.underlyingAmount` as shown in the `unstake()` function below.\n\nhttps://etherscan.io/address/0x9d39a5de30e57443bff2a8307a4256c8797a3497#code#F1#L80\n\n```solidity\nFile: StakedUSDeV2.sol\n77:   /// @notice Claim the staking amount after the cooldown has finished. The address can only retire the full amount of assets.\n78:   /// @dev unstake can be called after cooldown have been set to 0, to let accounts to be able to claim remaining assets locked at Silo\n79:   /// @param receiver Address to send the assets by the staker\n80:   function unstake(address receiver) external {\n81:     UserCooldown storage userCooldown = cooldowns[msg.sender];\n82:     uint256 assets = userCooldown.underlyingAmount;\n83: \n84:     if (block.timestamp >= userCooldown.cooldownEnd || cooldownDuration == 0) {\n85:       userCooldown.cooldownEnd = 0;\n86:       userCooldown.underlyingAmount = 0;\n87: \n88:       silo.withdraw(receiver, assets);\n89:     } else {\n90:       revert InvalidCooldown();\n91:     }\n92:   }\n```\n\nThis point is also further supported by the codebase's comment below.\n\nhttps://github.com/sherlock-audit/2025-06-notional-exponent/blob/main/notional-v4/src/withdraws/Ethena.sol#L94\n\n```solidity\nFile: Ethena.sol\n091:     function canFinalizeWithdrawRequest(uint256 requestId) public view override returns (bool) {\n092:         uint24 duration = sUSDe.cooldownDuration();\n093:         address holder = address(uint160(requestId));\n094:         // This valuation is the amount of USDe the account will receive at cooldown, once\n095:         // a cooldown is initiated the account is no longer receiving sUSDe yield. This balance\n096:         // of USDe is transferred to a Silo contract and guaranteed to be available once the\n097:         // cooldown has passed.\n098:         IsUSDe.UserCooldown memory userCooldown = sUSDe.cooldowns(holder);\n099:         return (userCooldown.cooldownEnd < block.timestamp || 0 == duration);\n100:     }\n```\n\nHowever, in the protocol, whenever a Withdraw Request (WR) has not been finalized, it will always be priced in yield token (in this case, it is sUSDe), which is incorrect in this instance for Etherna's USDe/sUSDe. This is shown in Line 330 below.\n\nhttps://github.com/sherlock-audit/2025-06-notional-exponent/blob/main/notional-v4/src/withdraws/AbstractWithdrawRequestManager.sol#L330\n\n```solidity\nFile: AbstractWithdrawRequestManager.sol\n307:     function getWithdrawRequestValue(\n308:         address vault,\n309:         address account,\n310:         address asset,\n311:         uint256 shares\n312:     ) external view override returns (bool hasRequest, uint256 valueInAsset) {\n313:         WithdrawRequest memory w = s_accountWithdrawRequest[vault][account];\n314:         if (w.requestId == 0) return (false, 0);\n315: \n316:         TokenizedWithdrawRequest memory s = s_tokenizedWithdrawRequest[w.requestId];\n317: \n318:         int256 tokenRate;\n319:         uint256 tokenAmount;\n320:         uint256 tokenDecimals;\n321:         uint256 assetDecimals = TokenUtils.getDecimals(asset);\n322:         if (s.finalized) {\n323:             // If finalized the withdraw request is locked to the tokens withdrawn\n324:             (tokenRate, /* */) = TRADING_MODULE.getOraclePrice(WITHDRAW_TOKEN, asset);\n325:             tokenDecimals = TokenUtils.getDecimals(WITHDRAW_TOKEN);\n326:             tokenAmount = (uint256(w.yieldTokenAmount) * uint256(s.totalWithdraw)) / uint256(s.totalYieldTokenAmount);\n327:         } else {\n328:             // Otherwise we use the yield token rate\n329:             (tokenRate, /* */) = TRADING_MODULE.getOraclePrice(YIELD_TOKEN, asset);\n330:             tokenDecimals = TokenUtils.getDecimals(YIELD_TOKEN);\n331:             tokenAmount = w.yieldTokenAmount;\n332:         }\n```\n\nAs shown in the logic of `cooldownShares` function above, sUSDe no longer exists and has already been converted to a fixed number of USDe. Thus, the correct approach is to price the WR in the fixed amount of USDe instead of sUSDe\n\nIf the `getWithdrawRequestValue` is priced in sUSDe, the value it returns will either be inflated because the value of sUSDe rises over time or undervalued if sUSDe depeg.\n\nFor instance, the price of USDe is 1 USD, and one sUSDe is worth 1.18 USDe. Thus, the price of sUSDe is 1.18 USD. During the initiate withdrawal, assume that 100 sUSDe of yield tokens will be burned. As such, the WR's `yieldTokenAmount` will be set to 100 sUSDe. When `StakedUSDeV2.cooldownShares()` function is executed, Etherna will burn 100 sUSDe and escrowed a fixed 118 USDe to be released to the WRM once the cooldown period is over.\n\nAssume that the price of sUSDe increases from 1.18 USD to 1.50 USD some time later. In this case, the protocol will still continue to price the WR in yield token (sUSDe) and determine that the value of WR is worth 150 USD, even though it is only worth 118 USD because only a maximum of 118 USDe can be withdrawn from Etherna. The [sUSDe/USD Chainlink price feed](https://data.chain.link/feeds/ethereum/mainnet/susde-usd) shows that the price of sUSDe increases continuously over time.\n\nIf the value of WR is 118 USD, the account is already underwater and is subject to liquidation. However, due to the bugs, the protocol incorrectly priced the WR as 150 USD, and believes the account is healthy, preventing the liquidator from liquidating the unhealthy account. Additionally, if the value of WR is inflated, users can borrow more than they are permitted to.\n\n### Impact\n\nHigh. Inflating the value of WR causes liquidation not to happen when it should OR lead to users borrowing more than they are permitted to, leading to bad debt accumulating and protocol insolvency, which are serious problems. On the other hand, undervaluation of WR leads to the premature liquidation of the user's position, resulting in a loss for the user.\n\n\n### PoC\n\n_No response_\n\n### Mitigation\n\n_No response_\n\n",
    "summary": "\nThis bug report is about a problem found in the Notional platform, specifically in the way withdrawal requests are priced. The bug was found by a user named xiaoming90 and it can have a high impact on the platform. \n\nThe root cause of the bug is that when a withdrawal request is being priced, it is always priced against the number of yield tokens within the request. This is usually the correct approach, but in some cases it can be incorrect. For example, if a major slashing event occurs, the market price of the yield token may decrease, but the protocol will still price the request based on the original value. This can lead to incorrect pricing and potentially cause issues such as liquidation not happening when it should or users borrowing more than they are allowed to. \n\nThe attack path for this bug is that when a withdrawal request is initiated, the protocol will convert the yield tokens into a fixed amount of stable assets. However, when the request is being priced, the protocol will still use the value of the yield tokens instead of the fixed amount of stable assets. This can result in the value of the request being inflated or undervalued, depending on the market conditions. \n\nThe impact of this bug is high, as it can lead to liquidations not happening when they should or users borrowing more than they are allowed to, which can cause bad debt and insolvency for the platform. \n\nThere is currently no response or mitigation plan for this bug. ",
    "report_date": "2025-07-18T15:00:00.000Z",
    "contest_prize_txt": "75500 USDC",
    "contest_link": "https://app.sherlock.xyz/audits/contests/1001",
    "sponsor_name": "",
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "",
    "github_link": "https://github.com/sherlock-audit/2025-06-notional-exponent-judging/issues/665",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "1001",
    "slug": "m-14-value-of-ethernas-withdrawal-request-is-incorrect-sherlock-notional-exponent-git",
    "firm_name": "Sherlock",
    "firm_logo_square": "sherlock_square.png",
    "protocol_name": "Notional Exponent",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "xiaoming90"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Sherlock",
        "logo_square": "sherlock_square.png"
    },
    "protocols_protocol": {
        "name": "Notional Exponent",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}