{
    "id": 62114,
    "kind": "GIT",
    "auditfirm_id": 3,
    "impact": "MEDIUM",
    "finders_count": 4,
    "protocol_id": 3135,
    "title": "M-3: stETH edge case in transfer rounding can cause denial of service for depositors and redeemers.",
    "content": "\nSource: https://github.com/sherlock-audit/2025-07-mellow-flexible-vaults-judging/issues/141 \n\nThis issue has been acknowledged by the team but won't be fixed at this time.\n\n## Found by \n0x23r0, 0xShoonya, Kirkeelee, t.aksoy\n\n### Summary\n\nThe use of stETH, which can transfer 1-2 [wei](https://docs.lido.fi/guides/lido-tokens-integration-guide/#1-2-wei-corner-case) less than requested due to its internal share-based accounting and rounding, will cause a denial of service for depositors and redeemers as the contract will revert when attempting to transfer more stETH than it actually holds.\n\n### Root Cause\n\nThe root cause of the issue lies in how the queue contracts handle the `assets `variable during deposits, cancellations, and batch processing. When a user deposits stETH, the contract assumes that the exact amount specified by the user is received and records this value in its internal accounting. However, due to stETH’s internal share-based accounting and rounding, the contract may actually receive 1-2 wei less than the requested amount. This discrepancy is not accounted for in the contract’s logic. As a result, when a user later cancels their deposit or when a batch is processed in the `_handleReport `function, the contract attempts to transfer the full recorded assets amount to the user or the vault using `TransferLibrary.sendAssets`. If the contract’s actual stETH balance is less than the recorded assets due to the initial shortfall, the transfer will revert. This leads to a denial of service for users attempting to cancel, claim, or process deposits/redeems, as the contract cannot fulfill the transfer with its actual balance. The fundamental problem is the assumption that the contract always receives and holds exactly the amount of stETH specified in user actions, without verifying or adjusting for the real amount received.\n\nhttps://github.com/sherlock-audit/2025-07-mellow-flexible-vaults/blob/main/flexible-vaults/src/queues/DepositQueue.sol#L115\n\n### Internal Pre-conditions\n\n1. A user deposits or redeems stETH through the queue contracts.\n2. The contract receives slightly less stETH than requested due to stETH's transfer rounding.\n3. The contract records the full requested amount in its internal accounting.\n\n### External Pre-conditions\n\n1. stETH is used as the asset for the queue.\n2. stETH's transfer function rounds down and delivers less than the requested amount.\n\n### Attack Path\n\n1. User deposits or redeems stETH.\n2. The contract receives less stETH than expected.\n3. When the user later cancels, claims, or when a batch is processed, the contract attempts to transfer the full recorded amount.\n4. The transfer reverts because the contract does not have enough stETH, causing a denial of service for all subsequent users attempting to withdraw or claim.\n\n### Impact\n\nThe users cannot withdraw, claim, or process their deposits or redemptions, resulting in a denial of service for affected users. No funds are lost, but users are unable to access their assets.\n\n### PoC\n\n_No response_\n\n### Mitigation\n\nTrack the actual amount of stETH received by checking the contract balance before and after transfers, and use the real received amount for all internal accounting and subsequent transfers.\n\n",
    "summary": "\nThis bug report discusses an issue with the use of stETH, which can result in a denial of service for depositors and redeemers. The root cause of the problem is that the contract assumes it always receives the exact amount of stETH specified by the user, without accounting for any discrepancies due to stETH's internal share-based accounting and rounding. This can lead to a situation where the contract does not have enough stETH to fulfill transfers, resulting in a denial of service for users. The impact of this bug is that users are unable to withdraw, claim, or process their deposits or redemptions. To mitigate this issue, the team suggests tracking the actual amount of stETH received and using that for all internal accounting and transfers. ",
    "report_date": "2025-07-28T15:00:00.000Z",
    "contest_prize_txt": "70000 USDC",
    "contest_link": "https://app.sherlock.xyz/audits/contests/964",
    "sponsor_name": "",
    "sponsor_link": "",
    "quality_score": 2,
    "general_score": 1,
    "source_link": "",
    "github_link": "https://github.com/sherlock-audit/2025-07-mellow-flexible-vaults-judging/issues/141",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "964",
    "slug": "m-3-steth-edge-case-in-transfer-rounding-can-cause-denial-of-service-for-depositors-and-redeemers-sherlock-mellow-flexible-vaults-git",
    "firm_name": "Sherlock",
    "firm_logo_square": "sherlock_square.png",
    "protocol_name": "Mellow Flexible Vaults",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "0xShoonya"
            }
        },
        {
            "wardens_warden": {
                "handle": "t.aksoy"
            }
        },
        {
            "wardens_warden": {
                "handle": "Kirkeelee"
            }
        },
        {
            "wardens_warden": {
                "handle": "0x23r0"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Sherlock",
        "logo_square": "sherlock_square.png"
    },
    "protocols_protocol": {
        "name": "Mellow Flexible Vaults",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}