{
    "id": 62775,
    "kind": "MARKDOWN",
    "auditfirm_id": 37,
    "impact": "HIGH",
    "finders_count": 3,
    "protocol_id": 3426,
    "title": "Missing Check of `msg.value` in `bridgeOut()` Function Allows DoS or Stealing Funds",
    "content": "**Update**\nMarked as \"Fixed\" by the client. Addressed in: `95fad25a5770015dba8595595249a9fe8257b35e`.\n\n**File(s) affected:**`CampTimelockEscrowNativeOFT.sol`\n\n**Description:** The `bridgeOut()` function acts as the deposit entrypoint to the OFT bridge. It is supposed to receive native tokens, which are later bridged. The amount of tokens to be bridged is provided by the user with the `_originalAmount` parameter, however it is never verified against the actual supplied `msg.value`. This allows users to effectively initiate a bridging operation with debt, which then consumes tokens provided by other depositors.\n\nThis is particularly exploitable by whitelisted users, who can drain the contract immediately. Other users cannot affect already initiated deposits, and only misuse tokens from those initiated after the malicious one. This could be exploited in combination with frontrunning to steal funds while ensuring that sufficient funds are available for the validations in the `send()` function. Alternatively, creating a deposit with very high debt would effectively DoS the bridge as a whole, as this deposit cannot be skipped in the `batchRelease()` function.\n\n**Exploit Scenario:**\n\n1.   Alice makes a deposit of 10 tokens.\n2.   Mallory can create a deposit with `_originalAmount` of 10, without transferring native tokens. If Mallory is whitelisted, this is executed immediately and will consume the 10 tokens supplied by Alice.\n3.   Bob makes a deposit of 20 tokens. If mallory wasn't whitelisted, 10 of these tokens will be stolen by Mallory once the unlock period passes. If there are no other deposits, Bobs' bridging operation will fail due to insufficient contract balance. \n4.   Mallory creates a deposit with `_originalAmount` of 1e77. This can never be repayed, all future deposits are lost, no further bridging operation can occur.\n\n**Recommendation:** Ensure that the original deposit transfer of native tokens includes the incurred fees (see [](https://certificate.quantstamp.com/full/camp/ae830654-5f2b-4d21-aba2-1de572092da6/index.html#findings-qs2)[CAMP-2](https://certificate.quantstamp.com/full/camp/ae830654-5f2b-4d21-aba2-1de572092da6/index.html#findings-qs2)) and the required native tokens by checking against `msg.value`.",
    "summary": "\nThis report discusses a bug found in the `CampTimelockEscrowNativeOFT.sol` file that affects the `bridgeOut()` function. The function is supposed to receive native tokens, but it does not verify the amount of tokens provided by the user against the actual supplied `msg.value`. This allows users to initiate a bridging operation with debt, potentially leading to the loss of tokens provided by other depositors. The bug can be exploited by whitelisted users, who can drain the contract immediately, and can also be used in combination with front-running to steal funds. The report recommends fixing the bug by checking against `msg.value` and ensuring that the original deposit transfer includes the required fees and tokens.",
    "report_date": "2025-09-15T14:22:57.388Z",
    "contest_prize_txt": "",
    "contest_link": "https://certificate.quantstamp.com/full/camp/ae830654-5f2b-4d21-aba2-1de572092da6/index.html",
    "sponsor_name": "",
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://certificate.quantstamp.com/full/camp/ae830654-5f2b-4d21-aba2-1de572092da6/index.html",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "missing-check-of-msgvalue-in-bridgeout-function-allows-dos-or-stealing-funds-quantstamp-camp-markdown",
    "firm_name": "Quantstamp",
    "firm_logo_square": "quantstamp_square.png",
    "protocol_name": "Camp",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "Paul Clemson"
            }
        },
        {
            "wardens_warden": {
                "handle": "Gereon Mendler"
            }
        },
        {
            "wardens_warden": {
                "handle": "Andy Lin"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Quantstamp",
        "logo_square": "quantstamp_square.png"
    },
    "protocols_protocol": {
        "name": "Camp",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}