{
    "id": 62020,
    "kind": "MARKDOWN",
    "auditfirm_id": 37,
    "impact": "LOW",
    "finders_count": 3,
    "protocol_id": 3366,
    "title": "Malicious Users can Direct Some Validator Rewards to a Third-Party",
    "content": "**Update**\nMarked as \"Acknowledged\" by the client. The client provided the following explanation:\n\n> This is an accepted risk, as (1) validators can monitor their users as described, and (2) we expect that the rewards issuance will be changed in the future, which would likely render the immediately possible fixes obsolete.\n\n**File(s) affected:**`daml/splice-amulet/daml/Splice/Amulet.daml`, `daml/splice-amulet/daml/Splice/Amulet.daml`, `daml/splice-amulet/daml/Splice/Amulet.daml`\n\n**Description:** A user designates their chosen validator by having a`ValidatorRight`contract created, linking the user to a specific validator party. When this user performs a transfer, a`ValidatorRewardCoupon`is generated. This coupon allows the validator to redeem Amulet rewards for servicing the user.\n\nHowever, the current implementation of`ValidatorRewardCoupon` does not link the coupon directly to the`validator`party, and instead links it to the `user` party. The association with a validator is only established during coupon redemption, by requiring the redeeming validator to present a valid`ValidatorRight`contract for that user.\n\nThis design has two primary security and operational implications:\n\n1.   **Coupon Claim by Unintended Validators:**A user can have multiple`ValidatorRight`contracts active simultaneously, pointing to different validator parties (or even a party controlled by the user). Since the`ValidatorRewardCoupon`is only tied to the user,_any_ party holding a valid`ValidatorRight`for that user at the time of redemption can claim the coupon. This means a coupon generated due to user activity ostensibly serviced by Validator A could be claimed by Validator B, or by the user themselves if they set up such a`ValidatorRight`.\n2.   **Unclaimable Rewards After`ValidatorRight`Revocation:**If a user revokes a`ValidatorRight`, the originally intended validator will lose the ability to claim rewards from`ValidatorRewardCoupon`s that were created _prior_ to this revocation. At the time of redemption, they would no longer possess the required`ValidatorRight`for that user.\n\nThese issues place a monitoring burden on validators. A validator might only detect such scenarios by observing an unexpected drop in rewards or by noticing that the user has multiple `ValidatorRight` contracts (if they have visibility through the user's party which they host). The only recourse for a validator suspecting misconfiguration or reward loss is to stop hosting the user.\n\nThe only rewards vulnerable are the rewards generated by CC usage fees and traffic purchases executed by the individual user using their user party. The user cannot siphon the rewards generated from other users serviced by the validator. Given that the rewards at risk are typically confined to the round associated with the specific `ValidatorRewardCoupon`, the issue only affects validator-as-a-service operators (and not self-hosted validators), and the CC usage fees are small compared to validator liveness rewards, the issue is assigned a Low severity.\n\n**Recommendation:** Ideally, rewards should be attributed to a validator party at the time of coupon creation rather than the `ValidatorRight` at the moment of coupon redemption.\n\nIn the meantime, validators should:\n\n*   Ensure their users have a unique`ValidatorRight`contract pointing exclusively to them if possible.\n*   Diligently monitor their actual earned rewards against expected rewards for their hosted users.\n*   Be aware that rewards can be claimed by other parties if a user has multiple`ValidatorRight`s, or become unclaimable if their`ValidatorRight`is revoked before redemption.",
    "summary": "",
    "report_date": "2025-08-14T13:19:40.214Z",
    "contest_prize_txt": "",
    "contest_link": "https://certificate.quantstamp.com/full/canton-coin-an-implementation-of-splice-amulet/d95ae8a5-34b5-4245-8afc-bfd5435e4632/index.html",
    "sponsor_name": "",
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://certificate.quantstamp.com/full/canton-coin-an-implementation-of-splice-amulet/d95ae8a5-34b5-4245-8afc-bfd5435e4632/index.html",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "malicious-users-can-direct-some-validator-rewards-to-a-third-party-quantstamp-canton-coin-an-implementation-of-splice-amulet-markdown",
    "firm_name": "Quantstamp",
    "firm_logo_square": "quantstamp_square.png",
    "protocol_name": "Canton Coin, an implementation of Splice Amulet",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "Gereon Mendler"
            }
        },
        {
            "wardens_warden": {
                "handle": "Ibrahim Abouzied"
            }
        },
        {
            "wardens_warden": {
                "handle": "Jonathan Mevs"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Quantstamp",
        "logo_square": "quantstamp_square.png"
    },
    "protocols_protocol": {
        "name": "Canton Coin, an implementation of Splice Amulet",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}