{
    "id": 62916,
    "kind": "PDF",
    "auditfirm_id": 6,
    "impact": "HIGH",
    "finders_count": 4,
    "protocol_id": 3462,
    "title": "Side effects of underlying directly donated to the VaultV2 or adapters positions",
    "content": "## Severity: High Risk\n\n## Context\n(No context files were provided by the reviewer)\n\n## Description\nThis finding describes the potential side effects or issues arising from someone donating underlying tokens directly to the **VaultV2** contract or to the market used by one of the adapters currently in use by the **VaultV2** itself (MetaMorpho v1.0/v1.1 vault or Morpho Blue market).\n\nIt's important to note that the `_totalAssets` state variable (used to calculate the exchange rate, new interest accrued, and how much can be withdrawn) will not be increased when funds are donated to the **VaultV2** or to the underlying market. This state variable is increased only by the `enter` function (called by the mint or deposit flow) or by `accrueInterest` when new interest is added to the existing `_totalAssets`.\n\nWhen funds are donated to the **VaultV2**, they can be deployed to the underlying market (to \"trigger\" the side effects/issues) only by the allocator user who needs to \"directly\" execute the `allocate` function. It's important to note that the funds donated to the **VaultV2** cannot be \"skimmed\" in any way; they can only be \"deployed\" by the allocator or simply used as part of the (not accounted) Idle Market liquidity.\n\n### Issues\n- **Issue: Donation to VaultV2**: `allocation[id]` is improperly increased:\n    When the allocator directly executes the `allocate(...)` function to deploy the donated funds, the `allocation` state mapping variable will be \"improperly\" increased. The scope of such variable is to track the funds that the suppliers actively allocate to a specific id (an identifier that could identify an adapter, a Morpho market, and so on) and are upper bounded by what the curator specifies via the `absoluteCap` or `relativeCap` state variable mapping.\n\n    By increasing `allocation[id]` by those donated funds, the **VaultV2** could end up preventing the \"real\" suppliers from deploying new funds to the adapter because the absolute/relative limits have been reached because of the donation.\n  \n- **Issue: `allocation[id]` is improperly decreased**:\n    This issue is the \"inverse\" of the one described above, and it is even more important when the funds are donated directly to the adapter's position in the market, because `allocation[id]` has never been increased due to a donation to the **VaultV2**.\n\n    In this case, a direct call to the `deallocate` function (that can be performed by the allocator or the sentinel) could improperly decrease the `allocation[id]` value, allowing suppliers to actively deploy more funds than expected compared to what the curator had planned by imposing absolute/relative upper limits via the `absoluteCap` and `relativeCap` mappings.\n\n- **Issue: Suppliers do not directly benefit from the donated funds**:\n    The interest generated by the markets used by the adapters is theoretically based on the `_totalAssets` value (and elapsed seconds), which is used as an input parameter of the `IVic.interestPerSecond`.\n\n    As stated, `_totalAssets` is only increased when funds are deployed through \"direct\" actions via the deposit or mint operations and the funds donated to the **VaultV2** or adapter's position in the market. This means that the donation, which creates side effects and issues (see points below), does not bring any direct and useful benefits to the existing suppliers given the current logic of the **VaultV2** contract.\n\n- **Issue: Loss reported by the adapter could deflate the share value**:\n    When the `allocate` or `deallocate` functions are executed directly (by allocator or sentinel) or indirectly (by the user root operation), they will attempt to account for the loss of the liquidity adapter. If we also consider the `forceDeallocate` function, the loss accounting is also \"expanded\" to all the active adapters to which funds have been deployed or donated in the past.\n\n    Because the donated funds are not accounted for in the `_totalAssets` and because the loss reported could be much higher than the funds actually supplied by the users (due to the donation), it could occur that the liquidity adapter or another adapter (in the case of `forceDeallocate`) reports a loss that is higher than expected or even greater than `_totalAssets` itself.\n\n    In this scenario, the share value will decrease, and the user will lose funds.\n\n## Recommendations\nOne possible solution (which creates trust/centralization issues of its own) would be to allow an authorized user to arbitrarily increase the `_totalAssets` state variable by the amount of funds that have been donated to the **VaultV2** or the adapter's markets.\n\n## Additional Comments\n**Spearbit**: With the PR 347, adapters (or at least the one currently implemented for **VaultV2**) do ignore donations on their behalf, but the **VaultV2** does not. Allocator users can still use the funds donated to the **VaultV2** (or the ones received by the **VaultV2** from the `forceDeallocate` penalty) to allocate them into adapters. \n\nThat part has not changed, and the above issues are still valid for that case.\n\n**Morpho**: These findings are also acknowledged: allocations are still constrained by the caps; effective allocations should indeed change when an allocator (de)allocates, and by design, the donated funds do not benefit the users (to avoid changing the share price instantly). This means that losses can be bounded, and so the issue regarding the loss is also acknowledged. Added PR 347.\n\n**Spearbit**: Verified.",
    "summary": "",
    "report_date": "2025-10-13T00:00:00.000Z",
    "contest_prize_txt": "",
    "contest_link": "https://github.com/spearbit/portfolio/blob/master/pdfs/Morpho-Vaults-v2-Spearbit-Security-Review-May-2025.pdf",
    "sponsor_name": null,
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://github.com/spearbit/portfolio/blob/master/pdfs/Morpho-Vaults-v2-Spearbit-Security-Review-May-2025.pdf",
    "github_link": "",
    "pdf_link": "https://solodit-bucket.s3.amazonaws.com/storage/reports/spearbit/Morpho-Vaults-v2-Spearbit-Security-Review-May-2025.pdf",
    "pdf_page_from": 6,
    "contest_id": "",
    "slug": "side-effects-of-underlying-directly-donated-to-the-vaultv2-or-adapters-positions-spearbit-none-morpho-vaults-v2-pdf",
    "firm_name": "Spearbit",
    "firm_logo_square": "spearbit_square.png",
    "protocol_name": "Morpho Vaults v2",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "Saw-mon and Natalie"
            }
        },
        {
            "wardens_warden": {
                "handle": "Om Parikh"
            }
        },
        {
            "wardens_warden": {
                "handle": "Jonatas Martins"
            }
        },
        {
            "wardens_warden": {
                "handle": "Emmanuele Ricci"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Spearbit",
        "logo_square": "spearbit_square.png"
    },
    "protocols_protocol": {
        "name": "Morpho Vaults v2",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}