{
    "id": 62693,
    "kind": "MARKDOWN",
    "auditfirm_id": 23,
    "impact": "HIGH",
    "finders_count": 1,
    "protocol_id": 3435,
    "title": "Inflation Attack in `PTokenModule.deposit` Draining Initial Deposits",
    "content": "##### Description\nThis issue has been identified within the `deposit` function of the `PTokenModule` contract.\n\nAn attacker can front-run initial depositors by depositing 1 wei of the underlying token to receive a single pToken. By then directly transferring a large amount of the underlying token to the contract, the attacker artificially inflates the `exchangeRate` because `totalSupply` remains unchanged while `getCash()` grows significantly. Consequently, any subsequent depositor who supplies tokens may end up receiving zero pTokens (due to integer division at the inflated exchange rate) and thus lose their funds. The attacker can then redeem their single pToken and drain the entire contract balance, including other users’ deposits.\n\nThe issue is classified as **critical** severity because it can result in a complete loss of funds for unsuspecting users.\n\n##### Recommendation\nWe recommend minting a small amount (for example, 1000) of “dead shares” during the initial mint to ensure that this inflation attack is not possible. Additionally, implement a check that the minted amount is greater than 0 to ensure a user always receives a positive number of pTokens when depositing.\n",
    "summary": "\nThe report describes a bug in the `deposit` function of the `PTokenModule` contract. The bug allows an attacker to manipulate the `exchangeRate` by depositing a small amount of the underlying token and then transferring a large amount to the contract. This can result in subsequent depositors receiving zero pTokens and losing their funds. The severity of the bug is classified as critical as it can lead to a complete loss of funds for users. To fix this issue, the report recommends minting a small amount of \"dead shares\" during the initial mint and implementing a check to ensure users always receive a positive number of pTokens when depositing.",
    "report_date": "2025-09-18T00:00:00.000Z",
    "contest_prize_txt": "",
    "contest_link": "",
    "sponsor_name": null,
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://github.com/mixbytes/audits_public/blob/master/NUTS%20Finance/Pike/README.md#1-inflation-attack-in-ptokenmoduledeposit-draining-initial-deposits",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "inflation-attack-in-ptokenmoduledeposit-draining-initial-deposits-mixbytes-none-nuts-finance-markdown",
    "firm_name": "MixBytes",
    "firm_logo_square": "mixbytes_square.png",
    "protocol_name": "NUTS Finance",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "MixBytes"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "MixBytes",
        "logo_square": "mixbytes_square.png"
    },
    "protocols_protocol": {
        "name": "NUTS Finance",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}