{
    "id": 62665,
    "kind": "MARKDOWN",
    "auditfirm_id": 23,
    "impact": "MEDIUM",
    "finders_count": 1,
    "protocol_id": 3435,
    "title": "Centralization Risks in Emergency Scenarios",
    "content": "##### Description\nThis issue has been identified within the overall design of the `SelfPeggingAsset` contract. \n\nThe contract lacks an emergency redemption mechanism for users to withdraw their tokens when losses from exchange rate fluctuations exceed the buffer capacity, causing the pool to become locked. In such scenarios, users’ funds remain inaccessible until the owner executes the `distributeLoss` function to adjust the total supply and release the pause. This design introduces a centralization risk, as access to funds depends solely on the owner’s intervention, which could be delayed or withheld if the owner is unavailable or unwilling to act.\n\nThe issue is classified as **medium** severity because it could result in funds being temporarily or permanently inaccessible, creating potential for misuse or prolonged disruption in emergency situations.\n##### Recommendation\nWe recommend implementing an emergency redemption function that allows users to withdraw their tokens proportionally during a paused state, potentially with a penalty or under specific conditions to deter abuse while enhancing user autonomy.",
    "summary": "\nThe `SelfPeggingAsset` contract has a problem where users may not be able to withdraw their tokens in certain situations. This is because the contract does not have a way for users to withdraw their tokens if the pool becomes locked due to losses from exchange rate fluctuations. This could be a problem if the owner of the contract is unavailable or unwilling to help. It is considered a medium severity issue as it could result in funds being inaccessible. To fix this, it is recommended to add an emergency redemption function that allows users to withdraw their tokens during a paused state with potential penalties or conditions to prevent misuse.",
    "report_date": "2025-09-19T00:00:00.000Z",
    "contest_prize_txt": "",
    "contest_link": "",
    "sponsor_name": null,
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://github.com/mixbytes/audits_public/blob/master/NUTS%20Finance/Tapio/README.md#2-centralization-risks-in-emergency-scenarios",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "centralization-risks-in-emergency-scenarios-mixbytes-none-nuts-finance-markdown",
    "firm_name": "MixBytes",
    "firm_logo_square": "mixbytes_square.png",
    "protocol_name": "NUTS Finance",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "MixBytes"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "MixBytes",
        "logo_square": "mixbytes_square.png"
    },
    "protocols_protocol": {
        "name": "NUTS Finance",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}