{
    "id": 62025,
    "kind": "MARKDOWN",
    "auditfirm_id": 37,
    "impact": "HIGH",
    "finders_count": 3,
    "protocol_id": 3367,
    "title": "Cooldown Period Can Be Bypassed Allowing Instant Unstaking",
    "content": "**Update**\nMarked as \"Fixed\" by the client. Addressed in: `3d82c229626f11633838f9aa94265d497a838de9`.\n\n**File(s) affected:**`SapienVault.sol`\n\n**Description:** The `initiateUnstake()` function in the `SapienVault` contract sets the cooldown start timestamp only if the user is not already in a cooldown state, as controlled by the condition `if (uint256(userStake.cooldownStart) == 0)`. This design creates an opportunity to bypass the intended cooldown period for the majority of a user's stake. Specifically, a user may initiate unstaking for a small portion of their stake, wait for the cooldown to complete, and then unstake the remaining amount without waiting again, effectively circumventing the cooldown for most of their tokens.\n\n**Exploit Scenario:**\n\n1.   A user stakes 1,000 tokens with a cooldown period of 7 days.\n2.   After the lockup period expires, the user initiates unstaking for only 1 token, which sets `cooldownStart` to the current block timestamp.\n3.   The user retains the remaining 999 tokens in active staking, continuing to receive associated benefits.\n4.   Once the 2-day cooldown completes for the 1 token, the user initiates unstaking for the remaining 999 tokens.\n5.   Since `cooldownStart` is already set and not updated, the cooldown is considered complete, allowing the user to immediately unstake all remaining tokens.\n\n**Recommendation:** To enforce the cooldown consistently, consider one of the following mitigations:\n\n*   **Update `cooldownStart` on each call to `initiateUnstake()`**, regardless of its current value. This ensures the cooldown period is enforced for each unstake request. Be aware that this approach may unintentionally reset the cooldown timer if users initiate small unstake amounts frequently.\n*   **Restrict unstaking to the full available amount** at once, thereby preventing partial cooldown circumvention.\n*   **Implement per-amount cooldown tracking**, associating each unstaked amount with its own cooldown start. This solution is the most accurate but requires structural changes to how stake and cooldowns are stored and managed.",
    "summary": "\nThe client has marked a bug in the `SapienVault` contract as \"Fixed\" in a recent update. The bug allows users to bypass the intended cooldown period for the majority of their staked tokens. This can be done by initiating unstaking for a small portion of their tokens, waiting for the cooldown to complete, and then unstaking the remaining amount without waiting again. The report suggests three possible solutions to address this issue: updating the `cooldownStart` on each call to `initiateUnstake()`, restricting unstaking to the full available amount, or implementing per-amount cooldown tracking. ",
    "report_date": "2025-07-02T00:00:00.000Z",
    "contest_prize_txt": "",
    "contest_link": "https://certificate.quantstamp.com/full/sapien-2/9f938662-5bf7-4dc3-8774-3e7a12204cc3/index.html",
    "sponsor_name": "",
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://certificate.quantstamp.com/full/sapien-2/9f938662-5bf7-4dc3-8774-3e7a12204cc3/index.html",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "cooldown-period-can-be-bypassed-allowing-instant-unstaking-quantstamp-sapien-2-markdown",
    "firm_name": "Quantstamp",
    "firm_logo_square": "quantstamp_square.png",
    "protocol_name": "Sapien - 2",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "Paul Clemson"
            }
        },
        {
            "wardens_warden": {
                "handle": "Julio Aguilar"
            }
        },
        {
            "wardens_warden": {
                "handle": "Tim Sigl"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "Quantstamp",
        "logo_square": "quantstamp_square.png"
    },
    "protocols_protocol": {
        "name": "Sapien - 2",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}