{
    "id": 62695,
    "kind": "MARKDOWN",
    "auditfirm_id": 23,
    "impact": "MEDIUM",
    "finders_count": 1,
    "protocol_id": 3435,
    "title": "Improper Validation of Price Feed Data",
    "content": "##### Description\nThis issue has been identified within both the `ChainlinkOracleProvider` and `PythOracleProvider` contracts.\n\nIn these modules, price data is fetched as a signed integer, then immediately cast to an unsigned integer. This casting can produce two main risks:\n\n1. **Negative Price Values** \n   Although highly unlikely for typical assets, if the oracle ever returns a negative price, casting that negative value to `uint256` would turn it into a very large positive integer (due to underflow). This can cause significant mispricing in collateral valuations and liquidity calculations, as the system would interpret a negative value as a highly inflated price.\n\n2. **Zero Price Values** \n   In more realistic scenarios, an oracle may temporarily return a zero price due to a feed error or extreme market conditions. A zero price passes through the cast without reverting, but subsequent validation steps in the Oracle Engine treat a zero price as valid if fallback oracles are configured and subsequently revert, even if the fallback oracle returns a valid price. This scenario can halt liquidation, redemption and borrowing operations, even when one of the oracles is functioning correctly. Ultimately, this could lead to bad debt if liquidations are postponed during volatile market events.\n\nExamples:\n- **ChainlinkOracleProvider** \n  ```solidity!\n  (, int256 price,, uint256 updatedAt,) = config.feed.latestRoundData();\n  return uint256(price) * (10 ** (36 - assetDecimals - priceDecimals));\n  ```\n  - A negative `price` becomes a large positive number.\n  - A zero `price` is treated as valid and can cause reverts downstream.\n\n- **PythOracleProvider**\n  ```solidity!\n  uint256 priceIn18Decimals = (uint256(uint64(priceInfo.price)) * (10 ** 18))\n      / (10 ** uint8(uint32(-1 * priceInfo.expo)));\n  ```\n  - A negative `price` similarly becomes a large positive number.\n  - A zero `price` is treated as valid and can trigger reverts in other parts of the system.\n\nThe issue is classified as **medium** severity because it can lead to a temporary halt of liquidations, borrowing, or redemptions in the protocol, potentially causing bad debt.\n\n##### Recommendation\nWe recommend adding explicit checks for negative or zero prices. For example:\n\n```solidity!\nif (price <= 0) {\n    revert InvalidPrice();\n}\n```\n\nSuch checks ensure that:\n- Negative values do not get misinterpreted as extremely large positive numbers.\n- Zero values are handled properly rather than silently causing reverts later in the Oracle Engine.\n",
    "summary": "\nThis bug report discusses an issue with two contracts, the ChainlinkOracleProvider and the PythOracleProvider, which fetch price data as a signed integer and then immediately cast it to an unsigned integer. This casting can cause two problems: negative price values being converted to large positive numbers, and zero price values being treated as valid and causing reverts in other parts of the system. This can lead to a temporary halt of important operations in the protocol and potentially cause bad debt. The report recommends adding explicit checks for negative and zero prices to prevent these issues from occurring. ",
    "report_date": "2025-09-18T00:00:00.000Z",
    "contest_prize_txt": "",
    "contest_link": "",
    "sponsor_name": null,
    "sponsor_link": "",
    "quality_score": 0,
    "general_score": 0,
    "source_link": "https://github.com/mixbytes/audits_public/blob/master/NUTS%20Finance/Pike/README.md#1-improper-validation-of-price-feed-data",
    "github_link": "",
    "pdf_link": "",
    "pdf_page_from": 0,
    "contest_id": "",
    "slug": "improper-validation-of-price-feed-data-mixbytes-none-nuts-finance-markdown",
    "firm_name": "MixBytes",
    "firm_logo_square": "mixbytes_square.png",
    "protocol_name": "NUTS Finance",
    "bookmarked": false,
    "read": false,
    "issues_issue_finders": [
        {
            "wardens_warden": {
                "handle": "MixBytes"
            }
        }
    ],
    "auditfirms_auditfirm": {
        "name": "MixBytes",
        "logo_square": "mixbytes_square.png"
    },
    "protocols_protocol": {
        "name": "NUTS Finance",
        "protocols_protocolcategoryscore": []
    },
    "issues_issuetagscore": []
}